app/controllers/api/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @booking = Booking.find_by(id: params[:id])

SELECT "bookings".* FROM "bookings" WHERE "bookings"."guest_id" = $1  [["guest_id", 1]]
---
    def index
        @bookings = Booking.where({guest_id: current_user.id})

INSERT INTO "bookings" ("check_in_date", "check_out_date", "guest_id", "number_of_guest", "listing_id", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @booking = Booking.create(booking_params)