app/controllers/api/homes_controller.rb

SELECT "homes".* FROM "homes"
SELECT "homes".* FROM "homes" WHERE "homes"."city" = $1  [["city", "Toronto"]]
---
    def index
        if !params[:searchParams]
            # debugger
            @homes = Home.all
        elsif params[:searchParams][:city]
            # debugger
            @homes = Home.where(city: params[:searchParams][:city])

SELECT "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def show
        @home = Home.find(params[:id])