app/controllers/api/listings_controller.rb

    def index
        @listings = Listing.all
        # byebug
        if params[:location]
            @listings = @listings.where(location: params[:location])
---
SELECT "listings".* FROM "listings" WHERE "listings"."location" = $1  [["location", "Miami"]]