app/controllers/api/listings_controller.rb

    def show
        @listing = Listing.includes(:bookings, :reviews).with_attached_photos.find_by(id: params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."listing_id" = $1  [["listing_id", 1]]
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."listing_id" = $1  [["listing_id", 1]]

    def index
        if !params[:searchParams]
            @listings = Listing.with_attached_photos.all
        elsif params[:searchParams][:city]
            @listings = Listing.with_attached_photos.where(city: params[:searchParams][:city])
---
SELECT "listings".* FROM "listings"
SELECT "listings".* FROM "listings" WHERE "listings"."city" = $1  [["city", "New York"]]

    def update
        @listing = Listing.find_by(id: params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]