app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @user = User.with_attached_photo.find_by(id: params[:id])