app/views/api/bookings/index.json.jbuilder

        json.extract! booking, :id, :check_in_date, :check_out_date, :guest_id, :listing_id, :number_of_guest, :price
        json.photos booking.listing.photos.map {|photo| url_for(photo)}
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]