app/views/api/bookings/show.json.jbuilder

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
json.listing @booking.listing, :id, :title, :city, :location, :latitude, :longitude
json.photos @booking.listing.photos.map {|photo| url_for(photo)}