app/views/api/users/show.json.jbuilder

SELECT "listings".* FROM "listings"
---
    json.host review.listing.user, :id, :first_name
    json.photos review.listing.photos.map {|photo| url_for(photo)}