app/controllers/homes_controller.rb

SELECT "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @home = Home.find(params[:id])