app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "_q3M5nu8ue17WJz3-i9akQ"], ["updated_at", "2021-11-02 03:17:53.886924"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save