app/views/api/listings/show.json.jbuilder

SELECT "reviews".* FROM "reviews" WHERE "reviews"."listing_id" = $1  [["listing_id", 6]]
---
json.host @listing.user, :id, :first_name, :last_name, :created_at
json.listing_reviews @listing.reviews .each do |review|